Ran Plan for 2 projects:

1. dir: `modules/gcs` workspace: `default`
1. dir: `modules/iam` workspace: `default`
---

### 1. dir: `modules/gcs` workspace: `default`
```diff
No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.
```

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -d modules/gcs
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](http:/lock?id=Finure%252Ftest%252Fmodules%252Fgcs%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -d modules/gcs
  ```

---
### 2. dir: `modules/iam` workspace: `default`
<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # google_service_account.service-account["test2:testsa23"] will be created
+ resource "google_service_account" "service-account" {
      + account_id   = "testsa23"
      + disabled     = false
      + display_name = "Velero SA"
      + email        = "testsa23@finure-465001.iam.gserviceaccount.com"
      + id           = (known after apply)
      + member       = "serviceAccount:testsa23@finure-465001.iam.gserviceaccount.com"
      + name         = (known after apply)
      + project      = "finure-465001"
      + unique_id    = (known after apply)
    }

  # google_service_account.service-account["test:testsa"] will be created
+ resource "google_service_account" "service-account" {
      + account_id   = "testsa"
      + disabled     = false
      + display_name = "Velero SA"
      + email        = "testsa@finure-465001.iam.gserviceaccount.com"
      + id           = (known after apply)
      + member       = "serviceAccount:testsa@finure-465001.iam.gserviceaccount.com"
      + name         = (known after apply)
      + project      = "finure-465001"
      + unique_id    = (known after apply)
    }

  # google_service_account_iam_member.workload_identity_binding["test2:testsa23"] will be created
+ resource "google_service_account_iam_member" "workload_identity_binding" {
      + etag               = (known after apply)
      + id                 = (known after apply)
      + member             = "serviceAccount:finure-465001.svc.id.goog[testsa/test]"
      + role               = "roles/iam.workloadIdentityUser"
      + service_account_id = "projects/finure-465001/serviceAccounts/testsa23@finure-465001.iam.gserviceaccount.com"
    }

  # google_service_account_iam_member.workload_identity_binding["test:testsa"] will be created
+ resource "google_service_account_iam_member" "workload_identity_binding" {
      + etag               = (known after apply)
      + id                 = (known after apply)
      + member             = "serviceAccount:finure-465001.svc.id.goog[testsa/test]"
      + role               = "roles/iam.workloadIdentityUser"
      + service_account_id = "projects/finure-465001/serviceAccounts/testsa@finure-465001.iam.gserviceaccount.com"
    }

Plan: 4 to add, 0 to change, 0 to destroy.
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -d modules/iam
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](http:/lock?id=Finure%252Ftest%252Fmodules%252Fiam%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -d modules/iam
  ```
Plan: 4 to add, 0 to change, 0 to destroy.

---
### Plan Summary

2 projects, 1 with changes, 1 with no changes, 0 failed

* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```